** DONE regen any reports that had errors [#A]              :@work:task:pdf:
CLOSED: [2021-04-15 Thu 13:47] SCHEDULED: <2021-04-15 Thu 09:30>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-15 Thu 13:37]--[2021-04-15 Thu 13:47] =>  0:10
:END:

Added: [2021-04-14 Wed 17:07]

** DONE email report pdfs [#A]                              :@work:task:pdf:
CLOSED: [2021-04-15 Thu 14:16] SCHEDULED: <2021-04-15 Thu 13:00>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-15 Thu 13:47]--[2021-04-15 Thu 14:16] =>  0:29
:END:

Added: [2021-04-14 Wed 16:46]

** DONE generate pdfs for march 2021 [#A]                   :@work:task:pdf:
CLOSED: [2021-04-15 Thu 13:37] SCHEDULED: <2021-04-14 Wed 15:15>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-15 Thu 12:41]--[2021-04-15 Thu 13:37] =>  0:56
CLOCK: [2021-04-15 Thu 12:27]--[2021-04-15 Thu 12:41] =>  0:14
CLOCK: [2021-04-14 Wed 16:47]--[2021-04-14 Wed 17:06] =>  0:19
CLOCK: [2021-04-14 Wed 16:40]--[2021-04-14 Wed 16:47] =>  0:07
CLOCK: [2021-04-14 Wed 15:15]--[2021-04-14 Wed 16:40] =>  1:25
:END:

Added: [2021-04-14 Wed 15:14]

** DONE pdf template update for March 2021 [#A]             :@work:task:pdf:
CLOSED: [2021-04-14 Wed 15:14] SCHEDULED: <2021-04-14 Wed 09:31>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-14 Wed 13:00]--[2021-04-14 Wed 15:14] =>  2:14
:END:

Added: [2021-04-14 Wed 09:31]

** DONE review deep dive [#A]                          :@work:task:deepdive:
CLOSED: [2021-04-08 Thu 13:57] SCHEDULED: <2021-04-08 Thu 14:05>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 13:53]--[2021-04-08 Thu 13:57] =>  0:04
:END:
reivew https://github.com/Z2hMedia/deep_dives/pull/5
Added: [2021-04-08 Thu 13:01]

** DONE review rachel's sql pr [#A]                      :@work:task:review:
CLOSED: [2021-04-06 Tue 17:02] SCHEDULED: <2021-04-06 Tue 16:57>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-06 Tue 16:57]--[2021-04-06 Tue 17:02] =>  0:05
:END:

Added: [2021-04-06 Tue 16:57]

** DONE finish script to re-export playgrounds [#A]      :@work:task:export:
CLOSED: [2021-04-08 Thu 09:55] SCHEDULED: <2021-04-05 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-07 Wed 14:40]--[2021-04-07 Wed 18:01] =>  3:21
CLOCK: [2021-04-07 Wed 13:10]--[2021-04-07 Wed 14:40] =>  1:30
CLOCK: [2021-04-07 Wed 09:50]--[2021-04-07 Wed 12:06] =>  2:16
CLOCK: [2021-04-06 Tue 17:02]--[2021-04-06 Tue 17:07] =>  0:05
CLOCK: [2021-04-06 Tue 16:00]--[2021-04-06 Tue 16:57] =>  0:57
CLOCK: [2021-04-06 Tue 14:40]--[2021-04-06 Tue 15:27] =>  0:47
CLOCK: [2021-04-06 Tue 12:07]--[2021-04-06 Tue 14:15] =>  2:08
CLOCK: [2021-04-06 Tue 11:07]--[2021-04-06 Tue 11:26] =>  0:19
CLOCK: [2021-04-05 Mon 10:15]--[2021-04-05 Mon 18:16] =>  8:01
CLOCK: [2021-04-01 Thu 15:00]--[2021-04-01 Thu 15:16] =>  0:16
:END:
[[file:~/Code/Go/reexport/main.go::package main][export script here]]

export done, just need to clean up the weird playgrounds

query to check on progress:
#+BEGIN_SRC sql
      select count(id),
             extract(month from updated_at) as m,
             extract(year from updated_at) yr
      from playgrounds
      group by extract(month from updated_at), extract(year from updated_at) order by yr,m;

  select count(id), is_biba,name is null as name_null, location is null as location_null, address is null as address_null from playgrounds group by name is null, location is null, address is null,is_biba;

    with base as (
                              select id,
                                     extract(year from updated_at) as yr,
                                     extract(month from updated_at) as mo,
                                     extract(day from updated_at) as da,
                                     extract(hour from updated_at) as hr
                                     from playgrounds
                                     where updated_at >= '2019-01-01 00:00:00' and updated_at < '2021-05-01 00:00:00'
                )
                select count(id),yr,mo,da,hr from base group by yr,mo,da,hr order by yr desc,da desc,hr desc;
#+END_SRC


Added: [2021-04-01 Thu 15:12]
** DONE look into localization bug [#A]                    :@work:task:l10n:
CLOSED: [2021-04-01 Thu 12:05] SCHEDULED: <2021-03-31 Wed 10:03>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-03-31 Wed 15:57]--[2021-03-31 Wed 16:02] =>  0:05
CLOCK: [2021-03-31 Wed 15:41]--[2021-03-31 Wed 15:42] =>  0:01
CLOCK: [2021-03-31 Wed 12:00]--[2021-03-31 Wed 12:18] =>  0:18
CLOCK: [2021-03-31 Wed 10:47]--[2021-03-31 Wed 11:50] =>  1:03
CLOCK: [2021-03-31 Wed 09:56]--[2021-03-31 Wed 10:38] =>  0:42
:END:
Android games localization reverted to a previous version, need to figure out
what happened so I can try to make sure it doesn't happen again
Added: [2021-03-31 Wed 09:55]

** DONE create dataset for data science test repo [#A] :@work:task:data:science:
CLOSED: [2021-04-01 Fri 16:00] SCHEDULED: <2021-04-01 Thu> DEADLINE: <2021-04-02 Fri>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-01 Thu 15:16]--[2021-04-01 Thu 15:47] =>  0:31
CLOCK: [2021-04-01 Thu 14:50]--[2021-04-01 Thu 15:13] =>  0:23
CLOCK: [2021-04-01 Thu 14:39]--[2021-04-01 Thu 14:46] =>  0:07
:END:
from slack:
3:23 PM Rachel:
  So, when you have time (again, no rush), could you make a fake dataset with the variables found in this document:
  https://github.com/Z2hMedia/biba-data-science-test/blob/main/data/data.md

  I based this off of `biba-backbot.playground_​prod.playground_​sessions` but excluded some of the fields. Could this fake dataset have:
   - one row for each session where eu.used.used, we.description, games are unnested to each contain only one value
   - I’m thinking a total of maybe 10-15k rows? Or whatever makes for a small enough .csv file.
Added: [2021-03-30 Tue 15:23]

** DONE review data science test for rachel              :@work:code:review:
CLOSED: [2021-04-01 Thu 14:38]
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:14
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Code TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-01 Thu 12:50]--[2021-04-01 Thu 13:40] =>  0:50
CLOCK: [2021-03-31 Wed 16:40]--[2021-03-31 Wed 17:28] =>  0:48
CLOCK: [2021-03-31 Wed 16:02]--[2021-03-31 Wed 16:25] =>  0:23
CLOCK: [2021-03-31 Wed 15:42]--[2021-03-31 Wed 15:57] =>  0:15
CLOCK: [2021-03-31 Wed 15:37]--[2021-03-31 Wed 15:41] =>  0:04
:END:
review https://github.com/Z2hMedia/biba-data-science-test for rachel
Added: [2021-03-31 Wed 15:36]

** DONE generate pdfs for march 2021 [#A]                   :@work:task:pdf:
CLOSED: [2021-04-14 Wed 17:07] SCHEDULED: <2021-04-14 Wed 15:15>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-14 Wed 16:47]--[2021-04-14 Wed 17:06] =>  0:19
CLOCK: [2021-04-14 Wed 16:40]--[2021-04-14 Wed 16:47] =>  0:07
CLOCK: [2021-04-14 Wed 15:15]--[2021-04-14 Wed 16:40] =>  1:25
:END:

Added: [2021-04-14 Wed 15:14]

** DONE pdf template update for March 2021 [#A]             :@work:task:pdf:
CLOSED: [2021-04-14 Wed 15:14] SCHEDULED: <2021-04-14 Wed 09:31>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-14 Wed 13:00]--[2021-04-14 Wed 15:14] =>  2:14
:END:

Added: [2021-04-14 Wed 09:31]

** DONE review deep dive [#A]                          :@work:task:deepdive:
CLOSED: [2021-04-08 Thu 13:57] SCHEDULED: <2021-04-08 Thu 14:05>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 13:53]--[2021-04-08 Thu 13:57] =>  0:04
:END:
reivew https://github.com/Z2hMedia/deep_dives/pull/5
Added: [2021-04-08 Thu 13:01]

** DONE review rachel's sql pr [#A]                      :@work:task:review:
CLOSED: [2021-04-06 Tue 17:02] SCHEDULED: <2021-04-06 Tue 16:57>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-06 Tue 16:57]--[2021-04-06 Tue 17:02] =>  0:05
:END:

Added: [2021-04-06 Tue 16:57]

** DONE finish script to re-export playgrounds [#A]      :@work:task:export:
CLOSED: [2021-04-08 Thu 09:55] SCHEDULED: <2021-04-05 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-07 Wed 14:40]--[2021-04-07 Wed 18:01] =>  3:21
CLOCK: [2021-04-07 Wed 13:10]--[2021-04-07 Wed 14:40] =>  1:30
CLOCK: [2021-04-07 Wed 09:50]--[2021-04-07 Wed 12:06] =>  2:16
CLOCK: [2021-04-06 Tue 17:02]--[2021-04-06 Tue 17:07] =>  0:05
CLOCK: [2021-04-06 Tue 16:00]--[2021-04-06 Tue 16:57] =>  0:57
CLOCK: [2021-04-06 Tue 14:40]--[2021-04-06 Tue 15:27] =>  0:47
CLOCK: [2021-04-06 Tue 12:07]--[2021-04-06 Tue 14:15] =>  2:08
CLOCK: [2021-04-06 Tue 11:07]--[2021-04-06 Tue 11:26] =>  0:19
CLOCK: [2021-04-05 Mon 10:15]--[2021-04-05 Mon 18:16] =>  8:01
CLOCK: [2021-04-01 Thu 15:00]--[2021-04-01 Thu 15:16] =>  0:16
:END:
[[file:~/Code/Go/reexport/main.go::package main][export script here]]

export done, just need to clean up the weird playgrounds

query to check on progress:
#+BEGIN_SRC sql
      select count(id),
             extract(month from updated_at) as m,
             extract(year from updated_at) yr
      from playgrounds
      group by extract(month from updated_at), extract(year from updated_at) order by yr,m;

  select count(id), is_biba,name is null as name_null, location is null as location_null, address is null as address_null from playgrounds group by name is null, location is null, address is null,is_biba;

    with base as (
                              select id,
                                     extract(year from updated_at) as yr,
                                     extract(month from updated_at) as mo,
                                     extract(day from updated_at) as da,
                                     extract(hour from updated_at) as hr
                                     from playgrounds
                                     where updated_at >= '2019-01-01 00:00:00' and updated_at < '2021-05-01 00:00:00'
                )
                select count(id),yr,mo,da,hr from base group by yr,mo,da,hr order by yr desc,da desc,hr desc;
#+END_SRC


Added: [2021-04-01 Thu 15:12]
** DONE look into localization bug [#A]                    :@work:task:l10n:
CLOSED: [2021-04-01 Thu 12:05] SCHEDULED: <2021-03-31 Wed 10:03>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-03-31 Wed 15:57]--[2021-03-31 Wed 16:02] =>  0:05
CLOCK: [2021-03-31 Wed 15:41]--[2021-03-31 Wed 15:42] =>  0:01
CLOCK: [2021-03-31 Wed 12:00]--[2021-03-31 Wed 12:18] =>  0:18
CLOCK: [2021-03-31 Wed 10:47]--[2021-03-31 Wed 11:50] =>  1:03
CLOCK: [2021-03-31 Wed 09:56]--[2021-03-31 Wed 10:38] =>  0:42
:END:
Android games localization reverted to a previous version, need to figure out
what happened so I can try to make sure it doesn't happen again
Added: [2021-03-31 Wed 09:55]

** DONE create dataset for data science test repo [#A] :@work:task:data:science:
CLOSED: [2021-04-01 Fri 16:00] SCHEDULED: <2021-04-01 Thu> DEADLINE: <2021-04-02 Fri>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-01 Thu 15:16]--[2021-04-01 Thu 15:47] =>  0:31
CLOCK: [2021-04-01 Thu 14:50]--[2021-04-01 Thu 15:13] =>  0:23
CLOCK: [2021-04-01 Thu 14:39]--[2021-04-01 Thu 14:46] =>  0:07
:END:
from slack:
3:23 PM Rachel:
  So, when you have time (again, no rush), could you make a fake dataset with the variables found in this document:
  https://github.com/Z2hMedia/biba-data-science-test/blob/main/data/data.md

  I based this off of `biba-backbot.playground_​prod.playground_​sessions` but excluded some of the fields. Could this fake dataset have:
   - one row for each session where eu.used.used, we.description, games are unnested to each contain only one value
   - I’m thinking a total of maybe 10-15k rows? Or whatever makes for a small enough .csv file.
Added: [2021-03-30 Tue 15:23]

** DONE move domains to Matt Toner                      :@work:email:domain:
SCHEDULED: <2021-03-29 Mon 13:00> DEADLINE: <2021-03-31 Wed>
:PROPERTIES:
:ORDERED:  t
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Email TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-03-30 Tue 14:00]--[2021-03-30 Tue 16:15] =>  2:00
:END:
he's got to set up a godaddy account and get the account email to me so i can
transfer these domains to him
Email: [[notmuch:id:rTNC.110543.9248257.702688686.1616949762.2491255.sKX@a2plmmsworker05.prod.iad2.gdg.mail][Mail: Matthew Toner: Product Failed Billing Notification]]
Added: [2021-03-28 Sun 19:30]

** DONE [#A] ssl expiry - games.bibabots.com               :@work:email:ssl:
CLOSED: [2021-03-29 Mon 10:12] DEADLINE: <2021-03-29 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Email TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-03-29 Mon 10:00]--[2021-03-29 Mon 10:12] =>  0:12
:END:

Email: [[notmuch:id:20210319T064019.2541558921159907309.expiry@letsencrypt.org][Mail: Let's Encrypt certificate expiration notice for domain "games.bibabots.com"]]
Added: [2021-03-28 Sun 19:14]

** DONE [#A] ssl expiry - localization.bibabots.com        :@work:email:ssl:
CLOSED: [2021-03-29 Mon 10:41] DEADLINE: <2021-03-29 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Email TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-03-29 Mon 10:15]--[2021-03-29 Mon 10:41] =>  0:26
:END:

Email: [[notmuch:id:20210319T062146.1507343864615732575.expiry@letsencrypt.org][Mail: Let's Encrypt certificate expiration notice for domain "localization.bibabots.com"]]
Added: [2021-03-28 Sun 19:13]

** DONE [#A] ssl expiry - playground.bibabots.com                :email:ssl:
CLOSED: [2021-03-29 Mon 11:05] SCHEDULED: <2021-03-30 Tue> DEADLINE: <2021-04-12 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:15
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Email TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: @work
:END:
:LOGBOOK:
CLOCK: [2021-03-29 Mon 10:48]--[2021-03-29 Mon 11:05] =>  0:17
- State "STARTED"    from "WAITING"    [2021-03-29 Mon 10:48]
- State "WAITING"    from "DONE"       [2021-03-29 Mon 10:48] \\
  waiting for dns to update
CLOCK: [2021-03-29 Mon 10:42]--[2021-03-29 Mon 10:48] =>  0:06
:END:
[[notmuch:id:20210324T180959.6186059984420050544.expiry@letsencrypt.org][Mail: Let's Encrypt certificate expiration notice for domain "playground.bibabots.com"]]
Added: [2021-03-25 Thu 23:11]

** DONE pdf reports for may 2021 [#A]                    :@work:task:report:
CLOSED: [2021-06-25 Fri 12:35] SCHEDULED: <2021-06-14 Mon 15:10>
:PROPERTIES:
:ARCHIVE_TIME: 2021-07-06 Tue 14:36
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-06-14 Mon 15:51]--[2021-06-14 Mon 18:33] =>  2:42
CLOCK: [2021-06-14 Mon 15:10]--[2021-06-14 Mon 15:51] =>  0:41
:END:

- [X] generate
- [X] send

Added: [2021-06-14 Mon 15:10]

** DONE burke numbers for byron [#A]                      :@work:task:burke:
CLOSED: [2021-06-07 Mon 12:18] SCHEDULED: <2021-06-07 Mon 10:44>
:PROPERTIES:
:ARCHIVE_TIME: 2021-07-06 Tue 14:36
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-06-07 Mon 10:44]--[2021-06-07 Mon 11:17] =>  0:33
:END:

Added: [2021-06-07 Mon 10:44]

pg metrics:
total biba playgrounds: 4306
playgrounds producing reports: 1552 - 1757 = 205 
cities with biba: 1879 - 2075 = 196

user/gameplay metrics:
unique users: 347784 - 314855 = 32929
total sessions: 1089625 - 984623 = 105002
total minutes: 10361770 - 9376148 = 985622

** DONE biba website 3.0 [#A]                           :@work:task:website:
CLOSED: [2021-06-25 Fri 12:35] SCHEDULED: <2021-05-26 Wed 10:26>
:PROPERTIES:
:ARCHIVE_TIME: 2021-07-06 Tue 14:36
:ARCHIVE_FILE: ~/Dropbox/Org/work.org
:ARCHIVE_OLPATH: Work TODOs
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-05-26 Wed 11:16]--[2021-05-26 Wed 11:55] =>  0:39
CLOCK: [2021-05-26 Wed 10:26]--[2021-05-26 Wed 11:14] =>  0:48
:END:

Added: [2021-05-26 Wed 10:26]

need to go over current ( and previous ) versions of the site to sort out what
we want/need from a new build of the website

- added stats from squarespace & google search console
- filling out new website needs section
  
** DONE data ask for Manitoba                             :@work:other:data:
DEADLINE: <2021-03-26 Fri>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:11
:ARCHIVE_FILE: ~/Dropbox/Org/work-taskdiary.org
:ARCHIVE_OLPATH: Tasks/2021/2021-03 March/2021-03-26 Friday
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
- State "DONE"       from "TODO"       [2021-03-26 Fri 14:36]
- State "TODO"       from "DONE"       [2021-03-26 Fri 14:01]
- State "DONE"       from "STARTED"    [2021-03-26 Fri 12:18]
- State "STARTED"    from "TODO"       [2021-03-26 Fri 11:28]
:LOGBOOK:
CLOCK: [2021-03-26 Fri 10:25]--[2021-03-26 Fri 12:18] =>  1:53
CLOCK: [2021-03-26 Fri 14:26]--[2021-03-26 Fri 14:37] =>  0:11
:END:
:PROPERTIES:
SCHEDULED: <2021-03-26 Fri 10:24>
PRIORITY: C
:END:
ask from sarah:

following on your research into Biba play sessions in Manitoba (475 sessions
concentrated mostly around Winnipeg and Brandon), the sales rep for the
territory was interested in finding out, if possible:

 - The time frame of the sessions
 - How they are trending
   
And any other interesting tidbits that might help us support his sales in the
province?

Added: [2021-03-26 Fri 10:24]

** DONE find active playgrounds in Kentucky & Tennessee    :@work:other:ask:
CLOSED: [2021-03-26 Fri 14:25]
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-26 Mon 11:11
:ARCHIVE_FILE: ~/Dropbox/Org/work-taskdiary.org
:ARCHIVE_OLPATH: Tasks/2021/2021-03 March/2021-03-26 Friday
:ARCHIVE_CATEGORY: Work
:ARCHIVE_TODO: DONE
:END:
- State "DONE"       from "STARTED"    [2021-03-26 Fri 14:25]
- State "STARTED"    from "TODO"       [2021-03-26 Fri 14:02]
- State "TODO"       from "DONE"       [2021-03-26 Fri 11:27]
- State "DONE"       from "TODO"       [2021-03-26 Fri 10:23]
:LOGBOOK:
CLOCK: [2021-03-26 Fri 14:02]--[2021-03-26 Fri 14:25] =>  0:23
CLOCK: [2021-03-26 Fri 10:12]--[2021-03-26 Fri 10:23] =>  0:11
:END:
:PROPERTIES:
SCHEDULED: <2021-03-26 Fri 10:11>
PRIORITY: C
:END:

- need to include report pdf links ( column list: rep name?, park name, park
  location, city, state, report pdf link )
Added: [2021-03-26 Fri 10:11]

*** DONE create new biba playgrounds for Croatia [#A]  :@work:other:import:
CLOSED: [2021-03-30 Tue 16:47]
:LOGBOOK:
CLOCK: [2021-03-30 Tue 16:15]--[2021-03-30 Tue 16:47] =>  0:30
:END:
:PROPERTIES:
SCHEDULED: <2021-03-30 Tue 14:30>
:END:
- [X] Igraliste (Playground) Batala - 42.653583, 18.085444
- [X] Igraliste (Playground) Uvala - 42.655765, 18.072299
- [X] Igraliste (Playground) Babin Kuk - 42.658325, 18.070979
- [X] Igraliste (Playground) Gruz - 42.657258, 18.087762
- [X] Igraliste (Playground) Mokosica - 42.674627, 18.114160
Added: [2021-03-30 Tue 13:11]

*** DONE receipts for sarah [#A]                      :@work:other:receipt:
CLOSED: [2021-04-01 Thu 12:05] SCHEDULED: <2021-03-31 Wed 10:38>
:LOGBOOK:
CLOCK: [2021-03-31 Wed 10:38]--[2021-03-31 Wed 10:47] =>  0:09
:END:
receipts for honeycomb and mailgun need to be forwarded to Sarah
Added: [2021-03-31 Wed 10:38]

*** DONE biba activity in yukon [#A]                     :@work:other:data:
CLOSED: [2021-04-01 Thu 16:02] SCHEDULED: <2021-04-01 Thu 10:00>
:LOGBOOK:
CLOCK: [2021-04-01 Thu 15:50]--[2021-04-01 Thu 16:00] =>  0:10
:END:
similar to request for manitoba, find info on sessions (if any) in yukon
Added: [2021-04-01 Thu 09:22]
*** DONE density in tennessee [#A]                       :@work:other:data:
CLOSED: [2021-04-06 Tue 11:01] SCHEDULED: <2021-04-01 Thu 10:00>
:LOGBOOK:
CLOCK: [2021-04-01 Thu 16:00]--[2021-04-01 Thu 17:00] =>  1:00
CLOCK: [2021-04-06 Tue 09:50]--[2021-04-06 Tue 11:00] =>  1:10
:END:
get activity at:
 - biba playgrounds
 - non-biba playgrounds
 - of sessions at non-biba playgrounds, see if there are any potential playgrounds

results:
 - 303 playgrounds in tn
   - 48 biba, 255 non-biba
 - 2428 sessions in tn
   - 345 sessions happened within 500m of a playground
     - 297 of those sessions happened at a biba playground
     - 45 didn't happen at a biba playground

here's what i've got for finding playgrounds that have sessions within 10km that
are in tennessee:       
#+BEGIN_SRC sql
with mb as (
    select polygon from `biba-backbot.utility_can.usa_states` where name="Tennessee"
),

playgrounds as (
    select id,name,address,is_biba,coords from `biba-backbot.playgrounds_prod.playgrounds` pg, mb 
    where st_contains(mb.polygon, pg.coords)
),
closest_pg as (
    SELECT as value 
        array_agg(
            struct<pgid string, sid string, pgcoord geography, scoord geography>(pg.id, s.session_id, pg.coords, s.session_coords) 
            order by st_distance(pg.coords, s.session_coords) 
            limit 1
        )[safe_offset(0)]
    FROM `biba-backbot.learning_can.et-clustered` s, playgrounds pg 
    where s.playground_id is null
    group by s.session_id
),

counts as (
    select
        pgid, 
        count(sid) c
    from closest_pg 
    group by pgid
),

dists as (
    select 
        pgid,
        avg(st_distance(pgcoord,  scoord)) avg_dist
    from closest_pg cpg 
    where st_distance(pgcoord, scoord)is not null
    group by pgid
)

select 
    pg.pgid, c.c, d.avg_dist 
from closest_pg pg 
left join counts c on pg.pgid=c.pgid 
left join dists d on pg.pgid=d.pgid
where d.avg_dist < 10000
#+END_SRC
 
Added: [2021-04-01 Thu 09:21]
*** DONE unbounce nutshell errors             :@work:bug:nutshell:unbounce:
CLOSED: [2021-04-05 Mon 18:14]
:LOGBOOK:
CLOCK: [2021-04-01 Thu 11:00]--[2021-04-01 Thu 11:30] => 0:30
:END:
 - whitepaper signup has errors, figure out what's going on
 - i think it was the webhook not mapping fields? added a mapping for the
   customer email, tested with a throwaway email and the lead showed up in
   nutshell so that's good

*** DONE check info@ email -- sean f needs access [#B]    :@work:other:ops:
CLOSED: [2021-04-06 Tue 11:31] SCHEDULED: <2021-04-06 Tue 11:29>
:LOGBOOK:
CLOCK: [2021-04-06 Tue 11:29]--[2021-04-06 Tue 11:31] =>  0:02
:END:

Added: [2021-04-06 Tue 11:29]
*** DONE see if Crespatown Elementary is generating reports [#A] :@work:other:report:
CLOSED: [2021-04-06 Tue 11:28] SCHEDULED: <2021-04-06 Tue 11:25>
:LOGBOOK:
CLOCK: [2021-04-06 Tue 11:26]--[2021-04-06 Tue 11:28] =>  0:02
:END:
id: 04e045a9-1bf5-49a1-ab93-ffbe2d65cf94
Added: [2021-04-06 Tue 11:25]

*** DONE get omnitech/austrlia playground activity for mike [#A] :@work:other:report:
CLOSED: [2021-04-26 Mon 11:47] SCHEDULED: <2021-04-23 Fri 15:21>
:LOGBOOK:
CLOCK: [2021-04-26 Mon 11:00]--[2021-04-26 Mon 11:47] =>  0:47
:END:

Added: [2021-04-23 Fri 15:21]

*** DONE matt ask for stats [#A]                          :@work:other:ask:
CLOSED: [2021-07-06 Tue 14:31] SCHEDULED: <2021-06-03 Thu 15:56>
:LOGBOOK:
CLOCK: [2021-06-04 Fri 15:00]--[2021-06-04 Fri 17:16] =>  2:16
CLOCK: [2021-06-04 Fri 13:00]--[2021-06-04 Fri 14:37] =>  1:37
CLOCK: [2021-06-03 Thu 15:56]--[2021-06-03 Thu 18:00] =>  2:04
:END:

Added: [2021-06-03 Thu 15:56]

Cities:

Burbank	      California	United States
Fairfield	  California	United States
Honolulu	    Hawaii	    United States
Houston	      Texas	        United States
Las Vegas	  Nevada	    United States
Los Angeles	  California	United States
Orlando	      Florida	    United States
Phoenix	      Arizona	    United States
San Antonio	  Texas	        United States
Temecula	    California	United States

Results:

september 2020

predicted
unacast
sessions   city	         state	
205.1	     Phoenix	     Arizona	
855.1	     Burbank	     California
478.0	     Temecula	     California
616.2	     Los Angeles	 California
184.9	     Fairfield	   California
84.5	     Orlando	     Florida	
728.4	     Honolulu	     Hawaii
235.4	     Las Vegas	   Nevada	
201.4	     San Antonio	 Texas	  
449.2	     Houston	     Texas

**** DONE analytics for playbiba.com                      :@work:ask:biba:
CLOSED: [2021-05-26 Wed 09:48]
:LOGBOOK:
CLOCK: [2021-05-26 Wed 09:43]--[2021-05-26 Wed 09:48] =>  0:05
:END:
Added: [2021-05-26 Wed 09:43]
- [X] do we have a google analytics account setup? checking for byron.
- [X] checking if we've got stats through squarespace

**** DONE updates to whisper walks site           :@work:ask:whisperwalks:
CLOSED: [2021-05-25 Tue 12:07]
:LOGBOOK:
CLOCK: [2021-04-30 Fri 11:07]--[2021-04-30 Fri 11:39] =>  0:32
CLOCK: [2021-04-30 Fri 10:35]--[2021-04-30 Fri 11:06] =>  0:31
:END:
Added: [2021-04-30 Fri 10:35]

**** Monday Morning Stand-UP                       :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-05 Mon 09:30]--[2021-04-05 Mon 09:50] =>  0:20
:END:
Added: <2021-04-05 Mon 18:12>
**** data team - deep dives                                :@work:meeting:
CLOSED: [2021-04-05 Mon 18:14]
:LOGBOOK:
CLOCK: [2021-04-01 Thu 9:45]--[2021-04-01 Thu 10:45] => 1:00
:END:
**** chat with byron & mike about unbounce                 :@work:meeting:
CLOSED: [2021-04-05 Mon 18:14]
:LOGBOOK:
CLOCK: [2021-04-01 Thu 10:45]--[2021-04-01 Thu 11:00] =>  0:15
:END:
- figure out domain stuff
- set up initial page to sort out stuff

**** all-hands meeting                                     :@work:meeting:
CLOSED: [2021-04-05 Mon 18:14]
:LOGBOOK:
CLOCK: [2021-04-01 Thu 9:30]--[2021-04-01 Thu 9:45] => 0:15
:END:
**** call with rachel                                 :@work:meeting:call:
:LOGBOOK:
CLOCK: [2021-04-06 Tue 14:19]--[2021-04-06 Tue 14:39] =>  0:20
:END:
Added: <2021-04-06 Tue 14:19>
  - quick question about some data thing for byron
  - where to put queries for biba->burke reports [[https://github.com/Z2hMedia/bigquery_query_book][Query Book]]
  - biba playgrounds shipped to playgrounds: 3557 (old number from george)
  - same, based on isBiba=true in BigQuery: 4344
**** tech team morning meeting                     :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-06 Tue 09:30]--[2021-04-06 Tue 09:53] =>  0:23
:END:
Added: <2021-04-06 Tue 09:29>
  - talk to rachel about deep dive stuff
  - figure out what i need to be made aware of before she leaves
  - any r/python code i need to become familiar with?

**** morning meeting                               :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-07 Wed 09:30]--[2021-04-07 Wed 09:49] =>  0:19
:END:
Added: <2021-04-07 Wed 09:37>

**** eod call                                          :@work:meeting:eod:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 15:41]--[2021-04-08 Thu 15:42] =>  0:01
:END:
Added: <2021-04-08 Thu 15:41>
 - call with rachel and byron

**** thursday biba team meeting                    :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 09:30]--[2021-04-08 Thu 09:47] =>  0:17
:END:
Added: <2021-04-08 Thu 09:30>

 - block off some time after Rachel & Sarah have left to discuss with Sean F &
   Byron about how to use Nutshell to manage the distribution of reports

**** morning meeting                               :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-09 Fri 09:30]--[2021-04-09 Fri 09:59] =>  0:29
:END:
Added: <2021-04-09 Fri 09:30>

**** morning all-hands meeting                     :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-12 Mon 09:33]--[2021-04-12 Mon 09:45] =>  0:12
:END:
Added: <2021-04-12 Mon 09:33>
 - need to make sure i'm good to go with getting what i need from Rachel before
   her last day
 - should be good on getting stuff for the report mailout

**** all-team standup                              :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-15 Thu 09:30]--[2021-04-15 Thu 09:47] =>  0:17
:END:
Added: <2021-04-15 Thu 09:30>

**** morning meeting                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-16 Fri 09:26]--[2021-04-16 Fri 10:00] =>  0:34
:END:
Added: <2021-04-16 Fri 10:15>

**** cmf discussion                                    :@work:meeting:cmf:
:LOGBOOK:
CLOCK: [2021-04-20 Tue 15:03]--[2021-04-20 Tue 15:32] =>  0:29
:END:
Added: <2021-04-20 Tue 15:03>
- matt's two things:
  - spoke to cmf about c2p ( biba-burke ) application -- where do we fit in; are
    we a prototype or a commercial thing.
    - prototype deadline: 20th, c2p deadline: 13th
    - prototype is "we know we can make this work, we just need to nail down the details"
- complete tech diligence so we know what exactly it is we're pursuing --
  DEADLINE FRIDAY (23rd) NOON
**** chat with byron                               :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-20 Tue 14:11]--[2021-04-20 Tue 14:24] =>  0:13
:END:
Added: <2021-04-20 Tue 14:11>
- seanf get on info@ list
- ensure we've removed sarah from stuff
- reset sarah's email password, share with byron & matt
- don't set up a forward on sarah's account yet
- remove her from slack


- send reports on monday 17th (preferably)

**** afternoon cmf meeting                             :@work:meeting:cmf:
:LOGBOOK:
CLOCK: [2021-04-21 Wed 16:09]--[2021-04-21 Wed 16:20] =>  0:11
:END:
Added: <2021-04-21 Wed 16:09>

**** morning all-team                              :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-21 Wed 10:00]--[2021-04-21 Wed 10:06] =>  0:06
:END:
Added: <2021-04-21 Wed 10:00>
- mike is away next week, when he's back he'll update the podcast copy to be
  more evergreen
- byron: cmf stuff today
- me: prototype for music game thing
- kushal: stuff for whisper walks

**** DONE prototype stuff                        :@work:meeting:research:
CLOSED: [2021-07-06 Tue 14:37] DEADLINE: <2021-04-30 Fri> SCHEDULED: <2021-04-26 Mon>
:LOGBOOK:
CLOCK: [2021-04-28 Wed 14:30]--[2021-04-28 Wed 16:11] =>  1:41
CLOCK: [2021-04-23 Fri 15:15]--[2021-04-23 Fri 15:38] =>  0:23
:END:
Added: <2021-04-23 Fri 15:26>
- find other people who have made similar apps ( guitar tuners )
  - plenty of guitar tuners, or apps to learn how to play the guitar (
    https://apps.apple.com/us/app/id1107532469?ign-mpt=uo%3D4 )
  - any games that involve music either
    - load a song, analyze it, and then let the user play through a 'level' (
      rock band style, hitting buttons in time to the music )
    - or have a pre-loaded set of songs, again, rockband style
- see if there are other libraries to do what we need
  - [[https://github.com/JorenSix/TarsosDSP][tarsosDSP]] ( android only )
  - [[https://stackoverflow.com/questions/1354084/real-time-pitch-detection][some libraries in this stackoverflow thread]]
  - [[https://aubio.org/][aubio]]
  - [[https://medium.com/@juniorbump/pitch-detection-in-android-using-tarsosdsp-a2dd4a3f04e9][example usage of tarsosDSP on android]]
  - [[https://github.com/vadymmarkov/Beethoven][Beethoven]] ( ios only )
  - [[https://www.idmt.fraunhofer.de/en/business_units/m2d/musicbricks.html][musicbricks]] (ios & android)
- or just guess at what other games are doing
  - [[https://stackoverflow.com/questions/1457228/pitch-recognition-of-musical-notes-on-a-smart-phone][pointers]]  
- [ ] put together a simple write-up on what options there are out there
- [ ] put together some requirements to determine if a method is viable or needs to be tossed out the window
- two lists:
  - libraries we could use
  - other games/companies doing similar things ( sound recognition, etc )

**** morning standup                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-26 Mon 10:00]--[2021-04-26 Mon 10:06] =>  0:06
:END:
Added: <2021-04-26 Mon 10:00>

**** DONE priorities, website                      :@work:meeting:meeting:
CLOSED: [2021-04-28 Wed 14:20]
:LOGBOOK:
CLOCK: [2021-04-27 Tue 13:58]--[2021-04-27 Tue 14:10] =>  0:12
:END:
Added: <2021-04-27 Tue 13:57>
 
**** morning standup                               :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-27 Tue 09:58]--[2021-04-27 Tue 10:07] =>  0:09
:END:
Added: <2021-04-27 Tue 09:59>

- my plan for today:
  - work on pdf generation, update to use new stuff
  - plan to do report generation in first week of may

- sean f today:
  - updating nutshell so that it's got all the distribution list stuff in there

**** morning stand-up                              :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-04-28 Wed 10:00]--[2021-04-28 Wed 10:10] =>  0:10
:END:
Added: <2021-04-28 Wed 09:59>
- kushal: doing builds
- me:
  - working on getting some email stats together for sean f
  - ask nis for updated biba logo with burke on the right, as well as burke logo
    for the 'healthy family fun' section

**** meeting with nis & aurora                     :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-04-29 Thu 13:00]--[2021-04-29 Thu 13:10] =>  0:10
:END:
Added: <2021-04-29 Thu 12:59>

- setting up web page for whisper walks in squarespace
- doesn't have to be too fancy
- need to be able embed clickable prototype
- landing page, clean
- need to have domain transfered to us so we can point it at squarespace (?)

  my tasks:
***** DONE setup base squarespace site
CLOSED: [2021-04-29 Thu 13:22]
:LOGBOOK:
CLOCK: [2021-04-29 Thu 13:10]--[2021-04-29 Thu 13:12] =>  0:02
:END:
***** DONE finish site setup once i've got assets from aurora
CLOSED: [2021-04-30 Fri 10:35]
:LOGBOOK:
CLOCK: [2021-04-29 Thu 15:30]--[2021-04-29 Thu 17:00] =>  1:30
:END:

**** leads call                                    :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-05-05 Wed 14:30]--[2021-05-05 Wed 15:08] =>  0:38
:END:
Added: <2021-05-05 Wed 14:38>

- call tomorrow to go over tech aspect of music game prototype
-

**** leads meeting                                 :@work:meeting:meeting:
:LOGBOOK:
CLOCK: [2021-05-06 Thu 15:02]--[2021-05-06 Thu 15:41] =>  0:39
:END:
Added: <2021-05-06 Thu 15:02>

- going over the music game prototype write-up
- do uml diagram
  - three parts:
    - step one: capture notes by analyzing pitch
    - step two: upload note data to backend that generates and saves midi file
    - step three: playback of song using web build of simple unity game

**** bibabots band doc                                :@work:meeting:biba:
:LOGBOOK:
CLOCK: [2021-05-18 Tue 13:24]--[2021-05-18 Tue 14:11] =>  0:47
CLOCK: [2021-05-18 Tue 11:46]--[2021-05-18 Tue 12:12] =>  0:26
:END:
Added: <2021-05-18 Tue 11:46>

- "social symphony"
- ai smoothing: ml component that makes the music sound nicer, blob opera style,
  using input from users to train the ml 
- tech note:
- dark spot:

**** talking about website stuff                   :@work:meeting:website:
:LOGBOOK:
CLOCK: [2021-05-26 Wed 10:11]--[2021-05-26 Wed 10:25] =>  0:14
:END:
Added: <2021-05-26 Wed 10:11>
- starting from blank slate
- need site that clearly handles our needs
- add questions/stuff to spreadsheet
- list out all the tech/other requirements for new site ( design, etc ), dump
  into spreadsheet -- we'll sort and whatnot later
**** morning meeting                                  :@work:meeting:biba:
:LOGBOOK:
CLOCK: [2021-05-26 Wed 10:04]--[2021-05-26 Wed 10:11] =>  0:07
:END:
Added: <2021-05-26 Wed 10:04>
- new website stuff with byron later

**** morning meeting                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-05-27 Thu 10:00]--[2021-05-27 Thu 10:08] =>  0:08
:END:
Added: <2021-05-27 Thu 10:08>

**** talking about website                            :@work:meeting:biba:
:LOGBOOK:
CLOCK: [2021-05-27 Thu 10:08]--[2021-05-27 Thu 10:19] =>  0:11
:END:
Added: <2021-05-27 Thu 10:08>

**** morning meeting                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-06-07 Mon 10:00]--[2021-06-07 Mon 10:10] =>  0:10
:END:
Added: <2021-06-07 Mon 10:01>

- whisperwalks password update
- get burke numbers for spreadsheet for byron

**** website meeting notes                         :@work:meeting:website:
:LOGBOOK:
CLOCK: [2021-06-14 Mon 14:04]--[2021-06-14 Mon 14:53] =>  0:49
:END:
Added: <2021-06-14 Mon 14:04>

- give collaborator access to website person
- l10n -- how to do

- palette to restrained
- nav is bad
- content is fine

**** meeting with rachel                         :@work:meeting:deepdives:
:LOGBOOK:
CLOCK: [2021-06-17 Thu 15:31]--[2021-06-17 Thu 15:54] =>  0:23
:END:
Added: <2021-06-17 Thu 15:31>

- want to get some deep dive drafts in the bank from rachel
- preferably about 3
- rachel needs average 40 hours starting from scratch, maybe less depending on
  depth of the dive
- maybe trying to do shorter one/two-page dives
-

**** morning meeting                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-06-22 Tue 10:32]--[2021-06-22 Tue 10:46] =>  0:14
:END:
Added: <2021-06-22 Tue 10:32>

- today: working on updating the pdf generator tooling to use the new APIs
- also: ask from sean f for error/unsubs from mailout
- going to talk to byron about deep dive stuff ( right after standup )
  - matt happy with state of play for the deep dives
  - idea from matt: for the next few months, just use bits from the deep dives
  - next whitepaper: are we doing one, who is doing it?

**** morning standup                               :@work:meeting:standup:
:LOGBOOK:
CLOCK: [2021-06-28 Mon 10:00]--[2021-06-28 Mon 10:13] =>  0:13
:END:
Added: <2021-06-28 Mon 10:12>

**** leads call                                    :@work:meeting:updates:
:LOGBOOK:
CLOCK: [2021-06-30 Wed 13:35]--[2021-06-30 Wed 15:12] =>  1:37
:END:
Added: <2021-06-30 Wed 13:34>

- updates on document
  - mike: learnings from previous experience we'd like to avoid

- more direct us-to-customer relationship
- need to have robust metrics system that can track all the stuff that needs to
  be tracked and surface kpi's to the leads
- build the smallest amount of things that can accomplish our goals

- play value, activiations through play
- parent-focused, not kid-focused

next steps:
- figuring out activations we can use as an mvp
- business model: monetizing content related to getting kids active (on playgrounds?)
  - ads in free version
  - subscription for no ads
  - affiliate links/codes for stuff parents might want to buy

next meeting: 10am July 5th ( Monday )

** DONE add these playgrounds if not already in the database
CLOSED: [2021-04-08 Thu 14:03] SCHEDULED: <2021-04-09 Fri>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Code/Go/src/github.com/Z2hMedia/playgrounds_service/TODO.org
:ARCHIVE_CATEGORY: Playgrounds
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: @work
:END:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 14:00]--[2021-04-08 Thu 14:03] =>  0:03
:END:
- [X] 36.741742, -94.407612 'Goodman Elementary' -- 117 N School St, Goodman, MO 64843, United States
- [X] 36.848022, -94.407166 'Neosho Middle School' -- 1400 Hale Mcginty Dr, Neosho, MO 64850, United States

** DONE fix playground names
CLOSED: [2021-04-08 Thu 13:00] SCHEDULED: <2021-04-09 Fri>
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Code/Go/src/github.com/Z2hMedia/playgrounds_service/TODO.org
:ARCHIVE_CATEGORY: Playgrounds
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: @work
:END:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 10:40]--[2021-04-08 Thu 13:00] =>  2:20
:END:
from this query:
#+BEGIN_SRC
select id,name from playgrounds where name ilike '%playground%playground%';
#+END_SRC

** DONE ensure export isn't fucking up playground id
CLOSED: [2021-04-08 Thu 14:04]
:PROPERTIES:
:ARCHIVE_TIME: 2021-04-15 Thu 14:17
:ARCHIVE_FILE: ~/Code/Go/src/github.com/Z2hMedia/playgrounds_service/TODO.org
:ARCHIVE_CATEGORY: Playgrounds
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: @work
:END:
:LOGBOOK:
CLOCK: [2021-04-08 Thu 14:03]--[2021-04-08 Thu 14:04] =>  0:01
:END:
see: 'Torrey Pines Elementary' in playgrounds base table
#+BEGIN_SRC
select
  id,name,address,concat(st_y(coords),',',st_x(coords)) as latlng,is_biba,valid_to, array_to_string(order_numbers,',')
from `biba-backbot.playgrounds_prod.playgrounds_base`
where lower(name) like 'torrey pine%'
#+END_SRC

*** call
:LOGBOOK:
CLOCK: [2021-05-04 Tue 13:45]--[2021-05-04 Tue 13:51] =>  0:06
:END:
appointment: between 2 & 4

1 877 517 6518 ext 532107
marcel

*** call
:LOGBOOK:
CLOCK: [2021-05-04 Tue 13:45]--[2021-05-04 Tue 13:51] =>  0:06
:END:
appointment: between 2 & 4

1 877 517 6518 ext 532107
marcel

** DONE notary call :@personal:task:townhouse:
CLOSED: [2021-05-10 Mon 22:16] SCHEDULED: <2021-04-28 Wed 16:17>
:PROPERTIES:
:ARCHIVE_TIME: 2021-06-09 Wed 21:35
:ARCHIVE_FILE: ~/Dropbox/Org/personal.org
:ARCHIVE_OLPATH: TODOs
:ARCHIVE_CATEGORY: personal
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-04-28 Wed 16:17]--[2021-04-28 Wed 16:29] =>  0:12
:END:
- scheduling time to come in and sign stuff
- need to bring three pieces of id
  - drivers license or passport
  - care card or major credit card
  - mandatory: social insurance card or t4 with sin on it
Added: [2021-04-28 Wed 16:16]

